// Description:
//   YOSHI-IKUZO

module.exports = (robot) => {
  const dictionary = [
    'テレビも無エ',
    'ラジオも無エ',
    'クルマもそれほど走って無エ',
    'ピアノも無エ',
    'バーも無エ',
    '電話も無エ',
    'ガスも無エ',
    'ギターも無エ',
    'ステレオ無エ',
    '生まれてこのかた見だごとア無エ',
    '喫茶も無エ',
    '集いも無エ',
    '薬屋無エ',
    '映画も無エ',
    'ディスコも無エ',
    'のぞきも無エ',
    'かける機械を見だごとア無エ',
    '新聞無エ',
    '雑誌も無エ',
    '信号無エ',
    'ある訳無エ',
    '俺らの村には電気が無エ',

    'おまわり毎日ぐーるぐる',
    '二時間ちょっとの散歩道',
    'バスは一日一度来る',
    'まったぐ若者ア俺一人',
    '婆さんと',
    '爺さんと',
    'たまに来るのは紙芝居',
    'レーザー・ディスクは何者だ？',
    'カラオケはあるけれど',

    '俺らこんな村いやだ',
    '東京へ出るだ',
    '東京でベコ飼うだ',
    '東京で馬車引くだ',
    '銀座に山買うだ'
  ]

  robot.respond(/(ガー|あーそれー|あーよいしょ)/, (msg) => {
    const max = 3;
    const n = Math.round(Math.random() * (max - 1)) + 1;
    let message = '';

    for (let i = 0; i < n; i++) {
      message += dictionary[Math.round(Math.random() * (dictionary.length - 1))] + '♪'
    }

    msg.send(message)
  })

  robot.respond(/ぐーるぐる/, (msg) => {
    msg.send('ぐーるぐるっ ぐーるぐるっ')
  })
}
